START = ("✍Это конкурс с розыгрышом крутых "
         "призов проводится при "
         "поддержке трёх каналов: "
         "@interaliex, @daysale, @hotcoupons."
         " В нём вы можете выиграть:"
         "\n\n1️⃣место: Xiaomi Mi 9T"
         "\n2️⃣место: Honor 10 Lite"
         "\n3️⃣место: Honor band 4"
         "\n4️⃣место: Сертификат на 2000 рублей в магазин на выбор"
         "\n5️⃣место: Сертификат на 1000 "
         "рублей в магазин на выбор"
         "\n\n**И ещё 10 сертификатов по 500 рублей!**"
         "\n\nДля этого тебе надо будет просто подписаться на 3 канала."
         " Для начала нажми 'Принять участие' ")

START_REG = ("Здорово! Тебе нужно "
             "подписаться всего "
             "на 3 канала: ")

FINISH_REG = ("Поздравляю! Теперь ты "
              "участвуешь в розыгрыше. \n\nТы можешь уве"
              "личить свои шансы пригласив друзей. "
              "Нажми на 'Друзья', чтобы получить свою реферальную "
              "ссылку!")

NEW_REF = "У вас новый реферал: "
NO_NEW_REF = ". Но он пока не завершил регистрацию"
REG_REF = ". Он завершил регистрацию, вы увеличили свои шансы на победу!"

INFO = ("✍Этот конкурс проводится благодаря "
        "поддержке трёх каналов: @interaliex @daysale @hotcoupons"
        "\nВ нём вы можете выиграть:"
        "\n\n1️⃣место: Xiaomi Mi 9T\n2️⃣место: Honor 10 Lite"
        "\n3️⃣место: Honor band 4"
        "\n4️⃣место: Сертификат на 2000 рублей в магазин на выбор"
        "\n5️⃣место: Сертификат на 1000 "
        "рублей в магазин на выбор"
        "\n\n**И ещё 10 сертификатов по 500 рублей!**")

NOT_PARTICIPATE = ("Ты ещё не участвуешь в "
                   "конкурсе, напиши /start для участия!")
PARTICIPATE = ("Ты уже участвуешь. Приглашай друзей, "
               "чтобы увеличить свои шансы. \n💯Нажми на "
               "'Друзья', чтобы получить свою "
               "реферальную ссылку.")

REF_LINK = "\n\nТвоя реферальная ссылка:\nt.me/SalesContestBot?start="
